#pragma once

#include <Windows.h>
#include <cstdint>

//struct UniqueItemsBIN //size=0x14C (332)
//{
//	WORD	uniqueId;		//+00
//	BYTE	uk1[0x20];		//+02
//	WORD	uniqueNameId;	//+22
//	BYTE	uk2[0x08];		//+24
//	union {
//		BYTE	flag;		//+2C
//		struct {
//			BYTE ukf : 2;
//			BYTE carry1 : 1;
//			BYTE ladder : 1;
//		};
//	};
//	BYTE	uk3[0x11F];		//+2D
//};

//struct DataTables//01EE6A20 * 01FDA2D0 //second comments=1.11
//{
//	BYTE			uk1[0xA78];			//+000
//	DWORD* monStats;			//+A78 //1.11 and 1.10
//	BYTE			uk2[0x4];			//+A7C
//	DWORD			nbMonStats;			//+A80 //1.11 and 1.10
//	BYTE			uk3[0x108];			//+A84
//	DWORD* skilldesc;			//+B8C
//	BYTE			uk4[0x4];			//+B90
//	DWORD			nbSkilldesc;		//+B94
//	DWORD* skills;				//+B98
//	BYTE			uk5[0x4];			//+B9C
//	DWORD			nbSkills;			//+BA0
//	int* nbSkillsPerPlayer;	//+BA4
//	int				maxSkillsPerPlayer;	//+BA8
//	WORD* playerSkills;		//+BAC
//	BYTE			uk6[0x14];			//+BB0
//	DWORD* charStats;			//+BC4
//	DWORD			nbCharStats;		//+BC8
//	DWORD* itemStatCost;		//+BCC
//	BYTE			uk7[4];				//+BD0
//	DWORD			nbItemStatCosts;	//+BD4
//	WORD* statsDescPriority;	//+BD8
//	DWORD			nbStatsDescPriority;//+BDC
//	BYTE			uk8[0x18];			//+BE0
//	DWORD* itemTypes;			//+BF8
//	DWORD			nbItemTypes;		//+BFC
//	BYTE			uk9[0x0C];			//+C00
//	DWORD* sets;				//+C0C //1.11 and 1.10
//	DWORD			nbSets;				//+C10 //1.11 and 1.10
//	BYTE			uk9b[0x4];			//+C14
//	DWORD* setItems;			//+C18 //1.11 and 1.10
//	DWORD			nbSetItems;			//+C1C //1.11 and 1.10
//	BYTE			uk10[0x4];			//+C20
//	UniqueItemsBIN* uniqueItems;		//+C24 //1.11 and 1.10
//	DWORD			nbUniqueItems;		//+C28 //1.11 and 1.10
//	BYTE			uk11[0x2C];			//+C2C
//	DWORD* levels;				//+C58
//	DWORD			nbLevels;			//+C5C
//	BYTE			uk12[0x64];			//+C60
//	DWORD* cubemain;			//+CC4 //14C0 by 148 for 1.11
//	DWORD			nbCubemain;			//+CC8 //14C4 for 1.11
//	DWORD			nbInventory;		//+CCC
//	DWORD* inventory;			//+CD0
//	BYTE			uk13[0x04];			//+CD4
//	DWORD			nbItems;			//+CD8
//	DWORD* items;				//+CDC
//	DWORD* itemsBis;			//+CE0
//	BYTE			uk14[0x1F8];		//+CDC
//	DWORD			nbRunes;			//+EDC
//	DWORD* runes;				//+EE0
//};
//
//extern DataTables* sgptDataTables;

struct D2PropertyStrc
{
	int32_t nProperty;					//0x00
	int32_t nLayer;						//0x04
	int32_t nMin;						//0x08
	int32_t nMax;						//0x0C
};

namespace diablo2 {
	namespace structures {
		struct unit;
		struct path;
		struct inventory;
		struct room;

		struct items_line;
		struct item_types_line;

		struct D2OpStatDataStrc
		{
			uint16_t nOpBase;						//0x00
			uint16_t nStat;							//0x02
			uint8_t nOp;							//0x04
			uint8_t nOpParam;						//0x05
		};

		struct D2ItemStatCostTxt
		{
			uint16_t wStatId;						//0x00
			uint16_t pad0x02;						//0x02
			uint32_t dwItemStatFlags;				//0x04
			uint8_t nSendBits;						//0x08
			uint8_t nSendParamBits;					//0x09
			uint8_t nCsvBits;						//0x0A
			uint8_t nCsvParam;						//0x0B
			uint32_t dwDivide;						//0x0C
			uint32_t dwMultiply;					//0x10
			uint32_t dwAdd;							//0x14
			uint8_t nValShift;						//0x18
			uint8_t nSaveBits;						//0x19
			uint8_t n09SaveBits;					//0x1A
			uint8_t pad0x1B;						//0x1B
			uint32_t dwSaveAdd;						//0x1C
			uint32_t dw09SaveAdd;					//0x20
			uint32_t dwSaveParamBits;				//0x24
			uint32_t dw09SaveParamBits;				//0x28
			int32_t dwMinAccr;						//0x2C
			uint8_t nEncode;						//0x30
			uint8_t pad0x31;						//0x31
			uint16_t wMaxStat;						//0x32
			int16_t nDescPriority;					//0x34
			uint8_t nDescFunc;						//0x36
			uint8_t nDescVal;						//0x37
			uint16_t wDescStrPos;					//0x38
			uint16_t wDescStrNeg;					//0x3A
			uint16_t wDescStr2;						//0x3C
			uint16_t wDescGrp;						//0x3E
			uint8_t nDescGrpFunc;					//0x40
			uint8_t nDescGrpVal;					//0x41
			uint16_t wDescGrpStrPos;				//0x42
			uint16_t wDescGrpStrNeg;				//0x44
			uint16_t wDescGrpStr2;					//0x46
			int16_t wItemEvent[2];					//0x48
			uint16_t wItemEventFunc[2];				//0x4C
			uint8_t nKeepZero;						//0x50
			uint8_t bIsBaseOfOtherStatOp;			//0x51
			uint8_t bHasOpStatData;					//0x52
			uint8_t bHasOpApplyingToItem;			//0x53
			uint8_t nOp;							//0x54
			uint8_t nOpParam;						//0x55
			uint16_t wOpBase;						//0x56
			uint16_t wOpStat[3];					//0x58
			uint16_t unk0x5E[64];					//0x5E - also related to op stats (see DATATBLS_LoadItemStatCostTxt)
			D2OpStatDataStrc pOpStatData[16];		//0xDE
			uint16_t pad0x13E;						//0x13E
			uint32_t dwStuff;						//0x140
		};
	}

	enum unit_stats_t {
		UNIT_STAT_STRENGTH = 0x0,
		UNIT_STAT_ENERGY = 0x1,
		UNIT_STAT_DEXTERITY = 0x2,
		UNIT_STAT_VITALITY = 0x3,
		UNIT_STAT_STATPTS = 0x4,
		UNIT_STAT_NEWSKILLS = 0x5,
		UNIT_STAT_HITPOINTS = 0x6,
		UNIT_STAT_MAXHP = 0x7,
		UNIT_STAT_MANA = 0x8,
		UNIT_STAT_MAXMANA = 0x9,
		UNIT_STAT_STAMINA = 0xA,
		UNIT_STAT_MAXSTAMINA = 0xB,
		UNIT_STAT_LEVEL = 0xC,
		UNIT_STAT_EXPERIENCE = 0xD,
		UNIT_STAT_GOLD = 0xE,
		UNIT_STAT_GOLDBANK = 0xF,
		UNIT_STAT_ITEM_ARMOR_PERCENT = 0x10,
		UNIT_STAT_ITEM_MAXDAMAGE_PERCENT = 0x11,
		UNIT_STAT_ITEM_MINDAMAGE_PERCENT = 0x12,
		UNIT_STAT_TOHIT = 0x13,
		UNIT_STAT_TOBLOCK = 0x14,
		UNIT_STAT_MINDAMAGE = 0x15,
		UNIT_STAT_MAXDAMAGE = 0x16,
		UNIT_STAT_SECONDARY_MINDAMAGE = 0x17,
		UNIT_STAT_SECONDARY_MAXDAMAGE = 0x18,
		UNIT_STAT_DAMAGEPERCENT = 0x19,
		UNIT_STAT_MANARECOVERY = 0x1A,
		UNIT_STAT_MANARECOVERYBONUS = 0x1B,
		UNIT_STAT_STAMINARECOVERYBONUS = 0x1C,
		UNIT_STAT_LASTEXP = 0x1D,
